Desktop/Rails/joblist/app/controllers/jobapplications_controller.rb

SELECT "jobapplications".* FROM "jobapplications"
---
  def index
    @jobapplications = Jobapplication.all

INSERT INTO "jobapplications" ("title", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "software engineer"], ["status", "Not Seen"], ["created_at", "2022-06-29 12:32:53.027733"], ["updated_at", "2022-06-29 12:32:53.027733"]]
---
  def create
    @jobapplication = Jobapplication.new(jobapplication_params)

    respond_to do |format|
      if @jobapplication.save

SELECT "jobapplications".* FROM "jobapplications" WHERE "jobapplications"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_jobapplication
      @jobapplication = Jobapplication.find(params[:id])