Desktop/Rails/joblist/app/controllers/jobslists_controller.rb

  def index
    @jobslists = Jobslist.all
---
SELECT "jobslists".* FROM "jobslists"

  def create
    @jobslist = Jobslist.new(jobslist_params)

    respond_to do |format|
      if @jobslist.save
---
INSERT INTO "jobslists" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Software Engineer"], ["description", "writing  codes"], ["created_at", "2022-06-23 11:59:27.033176"], ["updated_at", "2022-06-23 11:59:27.033176"]]

  def update
    respond_to do |format|
      if @jobslist.update(jobslist_params)
---
UPDATE "jobslists" SET "description" = ?, "updated_at" = ? WHERE "jobslists"."id" = ?  [["description", "protocol ssdfsdfbdvssssssssssssssnsodnsovidmosimimsdij hscniuhehrufmmcgunfuivnunune09rgndnv09aer98gmc9sfnvcmgr"], ["updated_at", "2022-06-23 13:42:44.066044"], ["id", 2]]

  def destroy
    @jobslist.destroy
---
DELETE FROM "jobslists" WHERE "jobslists"."id" = ?  [["id", 1]]

    def set_jobslist
      @jobslist = Jobslist.find(params[:id])
---
SELECT "jobslists".* FROM "jobslists" WHERE "jobslists"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]